In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [4]:
a = [1,2,3,4,5]

In [5]:
sr = pd.Series(a)

In [6]:
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
sr = pd.Series(a,index =["jan","feb","mar","apr","may"])
sr

jan    1
feb    2
mar    3
apr    4
may    5
dtype: int64

In [17]:
sr.reset_index()

  index  0
0   jan  1
1   feb  2
2   mar  3
3   apr  4
4   may  5

In [2]:
fruit ={"fruits": ["Apple","Banana","Pineapple","Mango","Cherry"],
"price":[150,120,80,100,60]}

In [8]:
fruit =pd.DataFrame(fruits)

In [9]:
fruit

      fruits  price
0      Apple    150
1     Banana    120
2  Pineapple     80
3      Mango    100
4     Cherry     60

In [1]:

pip install xlrd openpyxl

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
     ---------------------------------------- 0.0/96.5 kB ? eta -:--:--
     ---- ----------------------------------- 10.2/96.5 kB ? eta -:--:--
     -------- ----------------------------- 20.5/96.5 kB 217.9 kB/s eta 0:00:01
     ---------------- --------------------- 41.0/96.5 kB 279.3 kB/s eta 0:00:01
     -------------------------------------- 96.5/96.5 kB 501.7 kB/s eta 0:00:00
Requirement already satisfied: openpyxl in c:\users\netcomm\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\netcomm\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1
Note: you may need to restart the kernel to use updated packages.

In [10]:
data1 = pd.read_excel(r"C:\Users\Netcomm\Downloads\SampleSuperstore.xls")
data1.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [11]:
data1=df

NameError: name 'df' is not defined

In [13]:
df = data1

In [14]:
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   datetime64[ns]
 3   Ship Date      9994 non-null   datetime64[ns]
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9983 non-null   float64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: datetime64[ns](2), float64(4), int64(2), object(13)
memory usage: 1.6+ MB

In [16]:
df.isna().sum()
#finding the total null values in all columns

Row ID            0
Order ID          0
Order Date        0
Ship Date         0
Ship Mode         0
Customer ID       0
Customer Name     0
Segment           0
Country           0
City              0
State             0
Postal Code      11
Region            0
Product ID        0
Category          0
Sub-Category      0
Product Name      0
Sales             0
Quantity          0
Discount          0
Profit            0
dtype: int64

In [18]:
df.dropna(inplace = True)

In [19]:
df.isna().sum()

Row ID           0
Order ID         0
Order Date       0
Ship Date        0
Ship Mode        0
Customer ID      0
Customer Name    0
Segment          0
Country          0
City             0
State            0
Postal Code      0
Region           0
Product ID       0
Category         0
Sub-Category     0
Product Name     0
Sales            0
Quantity         0
Discount         0
Profit           0
dtype: int64

In [21]:
df.shape

(9983, 21)

In [22]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [23]:
df.drop(['Row ID', 'Order ID','Customer ID', 'Customer Name','Product Name'],axis=1, inplace = True)

In [24]:
df.shape

(9983, 16)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9983 entries, 0 to 9993
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order Date    9983 non-null   datetime64[ns]
 1   Ship Date     9983 non-null   datetime64[ns]
 2   Ship Mode     9983 non-null   object
 3   Segment       9983 non-null   object
 4   Country       9983 non-null   object
 5   City          9983 non-null   object
 6   State         9983 non-null   object
 7   Postal Code   9983 non-null   float64
 8   Region        9983 non-null   object
 9   Product ID    9983 non-null   object
 10  Category      9983 non-null   object
 11  Sub-Category  9983 non-null   object
 12  Sales         9983 non-null   float64
 13  Quantity      9983 non-null   int64
 14  Discount      9983 non-null   float64
 15  Profit        9983 non-null   float64
dtypes: datetime64[ns](2), float64(4), int64(1), object(9)
memory usage: 1.3+ MB

In [29]:
df["Postal Code"] = df["Postal Code"].astype("int")

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9983 entries, 0 to 9993
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order Date    9983 non-null   datetime64[ns]
 1   Ship Date     9983 non-null   datetime64[ns]
 2   Ship Mode     9983 non-null   object
 3   Segment       9983 non-null   object
 4   Country       9983 non-null   object
 5   City          9983 non-null   object
 6   State         9983 non-null   object
 7   Postal Code   9983 non-null   int32
 8   Region        9983 non-null   object
 9   Product ID    9983 non-null   object
 10  Category      9983 non-null   object
 11  Sub-Category  9983 non-null   object
 12  Sales         9983 non-null   float64
 13  Quantity      9983 non-null   int64
 14  Discount      9983 non-null   float64
 15  Profit        9983 non-null   float64
dtypes: datetime64[ns](2), float64(3), int32(1), int64(1), object(9)
memory usage: 1.3+ MB

In [31]:
df.describe()

        Postal Code         Sales     Quantity     Discount       Profit
count   9983.000000   9983.000000  9983.000000  9983.000000  9983.000000
mean   55245.233297    229.216818     3.788741     0.156375    28.463592
std    32038.715955    621.909610     2.223566     0.206501   234.122107
min     1040.000000      0.444000     1.000000     0.000000 -6599.978000
25%    23223.000000     17.280000     2.000000     0.000000     1.727100
50%    57103.000000     54.384000     3.000000     0.200000     8.643600
75%    90008.000000    209.905000     5.000000     0.200000    29.315200
max    99301.000000  22638.480000    14.000000     0.800000  8399.976000

In [33]:
print("Total Sales", df["Sales"].sum())
print("Total Profit", df["Profit"].sum())
print("Average Discount",df["Discount"].mean())
print("Average Quantity",df["Quantity"].mean())

Total Sales 2288271.4903
Total Profit 284152.0433999999
Average Discount 0.15637483722327958
Average Quantity 3.788740859461084

In [34]:
df["Sales"].sort_values(ascending = False).head()

2697    22638.480
6826    17499.950
8153    13999.960
2623    11199.968
4190    10499.970
Name: Sales, dtype: float64

In [35]:
df["Profit"].sort_values(ascending = False).head()

6826    8399.9760
8153    6719.9808
4190    5039.9856
9039    4946.3700
4098    4630.4755
Name: Profit, dtype: float64

In [38]:
df.col

NameError: name 'cat_col' is not defined